Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/checklists/checklist_of_things_to_do_following_a_bereavement.html.txt.tmx
Source language: en
Languages: ga

source: Checklist of things to do following a bereavement
ga: Seicliosta de nithe le déanamh ag lucht méala tar éis báis

source: • Register the death and obtain a death certificate
ga: • Téigh i dteagmháil le stiúrthóir sochraide chun an tsochraid a eagrú

source: • Contact a funeral director to arrange the funeral
ga: • Cuir fios ar aturnae an duine éagtha má tá a leithéid ann

source: • Notify the deceased's solicitor if there is one
ga: • Cuir fios ar na seiceadóirí atá ainmnithe san uacht

source: • Notify the executors named in the will
ga: • Cealaigh polasaithe árachais, árachas sláinte, srl

source: If there is no will, decide who to appoint as administrator to administer the deceased's estate
ga: • Déan teagmháil leis an Roinn Coimirce Sóisialaí má bhí an duine éagtha ag fáil íocaíochta

source: • Notify banks, building society, credit union, post office, companies in which shares are held, etc
ga: • Déan teagmháil leis An Post le haghaidh post a athdhíriú ar an seiceadóir nó ar riarthóir an eastáit. Ilghnéitheach

source: • Cancel Direct Debits/Standing Orders in the deceased's bank or building society
ga: • Cuir fostóir an duine éagtha ar an eolas má b'fhostaí é/í nó cuir an scoil / coláiste ar an eolas má bhí sé/sí sa chóras oideachais

source: • Cancel subscriptions to clubs/groups/magazines, etc
ga: • Déan teagmháil leis an dochtúir/ospidéal má bhí coinní ag an duine éagtha leo

source: • Cancel insurance policies, health insurance etc
ga: • Déan teagmháil le gníomhaireacht taistil, le hóstán, le haerlíne, srl
